import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-investment-opp-details',
  templateUrl: './investment-opp-details.component.html',
  styleUrls: ['./investment-opp-details.component.scss']
})
export class InvestmentOppDetailsComponent implements OnInit {


    journeyItems = [
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },

    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },

    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 3, title: 'الخطوة الثالثة', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 2, title: 'الخطوة الثانية', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },
    {
      id: 1, title: 'الخطوة الاولي', description: 'خدمة تتيح للمستفيد طالب التنفيذ من طلب إصدار أمر الحضانة لضمان حقه الشرعي المنصوص عليه في السند التنفيذي .'
    },


  ]

  responsiveOptions;

  constructor() { }

  ngOnInit(): void {
  }

}
