import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-investment-opps-main',
  templateUrl: './investment-opps-main.component.html',
  styleUrls: ['./investment-opps-main.component.scss']
})
export class InvestmentOppsMainComponent implements OnInit {

  investmentOpportunities;


  constructor() {

    this.investmentOpportunities = [
      {
        header: "الفرص الإستثمارية المتاحة",
        items: [
          {
            id: 1, type: 'فرصة الإستثمارية في مدينة الرياض', image: './assets/images/background/introbg.png',
            title: 'مدة عقد الإيجار تصل إلى 25 سنة',
            description: 'تقع الأرض في مدينة الرياض بحي المعذر الشمالي على طريق مكة المكرمة، ويمتاز موقعها بسهولة الوصول إلى المشاريع الكبرى في الرياض لوقوعها بين طريقي التخصصي والأمير تركي الأول وتبلغ مساحتها (8,000) م2'
          },
          {
            id: 2, type: 'فرصة الإستثمارية في مدينة الدمام', image: './assets/images/background/introbg2.png',
            title: 'مدة عقد الإيجار تصل إلى 25 سنة',
            description: 'تقع الأرض بحي السوق وسط الدمام على شارع الأمير محمد، ويمتاز موقعها بتنوع الأنشطة التجارية من حوله مثل المطاعم والمقاهي والتمونيات، وتبلغ مساحتها (2,389 )م2'
          },
          {
            id: 3, type: 'فرصة استمثارية في منطقة الباحة ', image: './assets/images/background/introbg3.png',
            title: 'مدة تأجيرية تصل إلى 10 سنوات ',
            description: 'قصر افراح بمحافظة بلجرشي تبلغ مساحته (7,885,87)م2 ويمتاز موقعها بالقرب من منطقة حيوية في وسط المدينة ووجودها على شارع مهم'
          },
          // {
          //   id: 4, type: 'فرصة إستمثارية في مدينة الرياض', image: './assets/images/background/introbg.png',
          //   title: 'مدة عقد الإيجار تصل إلى 25 سنة',
          //   description: 'تقع الأرض في مدينة الرياض بحي المعذر الشمالي على طريق مكة المكرمة، ويمتاز موقعها بسهولة الوصول إلى المشاريع الكبرى في الرياض لوقوعها بين طريقي التخصصي والأمير تركي الأول وتبلغ مساحتها (8,000) م2'
          // },
          // {
          //   id: 1, type: 'فرصة إستمثارية في مدينة الرياض', image: './assets/images/background/introbg.png',
          //   title: 'مدة عقد الإيجار تصل إلى 25 سنة',
          //   description: 'تقع الأرض في مدينة الرياض بحي المعذر الشمالي على طريق مكة المكرمة، ويمتاز موقعها بسهولة الوصول إلى المشاريع الكبرى في الرياض لوقوعها بين طريقي التخصصي والأمير تركي الأول وتبلغ مساحتها (8,000) م2'
          // },
          // {
          //   id: 2, type: 'فرصة إستمثارية في مدينة الدمام', image: './assets/images/background/introbg2.png',
          //   title: 'مدة عقد الإيجار تصل إلى 25 سنة',
          //   description: 'تقع الأرض بحي السوق وسط الدمام على شارع الأمير محمد، ويمتاز موقعها بتنوع الأنشطة التجارية من حوله مثل المطاعم والمقاهي والتمونيات، وتبلغ مساحتها (2,389 )م2'
          // },
          // {
          //   id: 3, type: 'فرصة إستمثارية في منطقة الباحة ', image: './assets/images/background/introbg3.png',
          //   title: 'مدة تأجيرية تصل إلى 10 سنوات ',
          //   description: 'قصر افراح بمحافظة بلجرشي تبلغ مساحته (7,885,87)م2 ويمتاز موقعها بالقرب من منطقة حيوية في وسط المدينة ووجودها على شارع مهم'
          // },
          // {
          //   id: 4, type: 'فرصة إستمثارية في مدينة الرياض', image: './assets/images/background/introbg.png',
          //   title: 'مدة عقد الإيجار تصل إلى 25 سنة',
          //   description: 'تقع الأرض في مدينة الرياض بحي المعذر الشمالي على طريق مكة المكرمة، ويمتاز موقعها بسهولة الوصول إلى المشاريع الكبرى في الرياض لوقوعها بين طريقي التخصصي والأمير تركي الأول وتبلغ مساحتها (8,000) م2'
          // },

        ],
      },
      {
        header: "الفرص الإستثمارية السابقة",
        items: [
        ],
      },
    ];


   }




  ngOnInit(): void {
  }

}
