import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-blog-preview',
  templateUrl: './blog-preview.component.html',
  styleUrls: ['./blog-preview.component.scss']
})
export class BlogPreviewComponent implements OnInit {
  items;
  constructor() { }

  ngOnInit(): void {

    this.items = [
      {
        id: 1, title: "تدشين منصة انتفاع", description: "أعلنت الهيئة العامة لعقارات الدولة عن تدشين منصة انتفاع وهي منصة إلكترونية تابعة للهيئة تقدم كافة الخدمات العقاريةو تسهل إنجاز الطلبات إلكترونياً للمستفيدين وتقدم أكثر من 30 خدمة إلكترونية"
      },
      {
        id: 2, title: "تهنئة بحلول شهر رمضان المبارك", description: "أسرة انتفاع تهنئكم بحلول شهر رمضان المبارك جعله الله رحمة ومغفرة للعالمين"
      },
      { id: 3, title: "قنوات التواصل لمنصة انتفاع", description: "تابع الآن الخدمات الرقمية المتنوعة لمنصة انتفاع من خلال منصتي Twitter وInstagram وتعرف على المزايا الجديدة مسبقاً" },
      { id: 4, title: "انتفاع موبايل", description: "أعلنت الهيئة العامة لعقارات الدولة عن إطلاق تطبيق انتفاع موبايل حيث سيتمكن المستفيدين من تحميل التطبيق والإستفادة  من الخدمات المقدمة"},
      { id: 5, title: "منصة انتفاع تطلق خدمة “طلب عقار” للجهات الحكومية" , description: "أعلنت الهيئة العامة لعقارات الدولة اليوم إطلاق خدمة طلب عقار عبر منصة انتفاع الإلكترونية، حيث ستمكّن الخدمة الجهات الحكومية من طلب عقار"},
    ]
  }

}
